Revit 2026 API

# ParameterTypeIdEnergyAnalysisAdvancedOptions Property

---

"Other Options"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId EnergyAnalysisAdvancedOptions { get; }
```
```vb
Public Shared ReadOnly Property EnergyAnalysisAdvancedOptions As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ EnergyAnalysisAdvancedOptions {
	ForgeTypeId^ get ();
}
```
```fsharp
static member EnergyAnalysisAdvancedOptions : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace